DOCFSKDEVII.ИИАнализДокументовOllama/src/InformationRegisters/ИАДО_МоделиЛокальногоOllama/ИАДО_МоделиЛокальногоOllama.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИАДО_МоделиЛокальногоOllama</name>
  <comment>Синхронизация с GET /api/tags. Флаг «Доступна для выбора» включает модель в списке карточки эксперта.</comment>
  <resources>
    <name>ДоступнаДляВыбора</name>
    <comment>Если истина — имя модели попадает в список выбора в карточке эксперта (провайдер Ollama).</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазмерБайт</name>
    <comment>Из ответа Ollama /api/tags (поле size).</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИмяМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DOCFSKDEVII.ИИАнализДокументовOllama/src/InformationRegisters/ИАДО_ПравилаЭкспертовДокументов/ИАДО_ПравилаЭкспертовДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИАДО_ПравилаЭкспертовДокументов</name>
  <comment>Одна запись = сочетание вида и тематики (пустая ссылка в измерении — «любой»). Промпт в строке обязателен: он уходит в ИИ вместе с текстом файла. ПорядокПрименения: меньше — выше приоритет.</comment>
  <resources>
    <name>Эксперт</name>
    <type>
      <types>CatalogRef.ИАДО_ЭкспертыИИ</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокПрименения</name>
    <comment>Меньшее число — выше приоритет при подборе.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПромптОбработкиДокументаХранилище</name>
    <comment>Как обработать текст документа для данного сочетания вида и тематики. Хранится в хранилище значения (без ограничения длины).</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидДокумента</name>
    <comment>Пустая ссылка — любой вид.</comment>
    <type>
      <types>CatalogRef.ВидыДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТематикаДокумента</name>
    <comment>Пустая ссылка — любая тематика.</comment>
    <type>
      <types>CatalogRef.ТематикиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DOCFSKDEVII.ИИАнализДокументовOllama/src/Enums/ИАДО_ПровайдерыИИ/ИАДО_ПровайдерыИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИАДО_ПровайдерыИИ</name>
  <comment>Куда отправляется запрос: локальный Ollama или облако OpenRouter (совместимый OpenAI API).</comment>
  <enumValues>
    <name>ЛокальныйOllama</name>
    <comment>POST /api/generate на вашем сервере (например :11434).</comment>
  </enumValues>
  <enumValues>
    <name>OpenRouterChat</name>
    <comment>POST /v1/chat/completions, ключ в константе «OpenRouter: ключ API».</comment>
  </enumValues>
</mdclass:Enum>

DOCFSKDEVII.ИИАнализДокументовOllama/src/Catalogs/ИАДО_ЭкспертыИИ/ИАДО_ЭкспертыИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИАДО_ЭкспертыИИ</name>
  <attributes>
    <name>ИмяМоделиOllama</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемныйПромптХранилище</name>
    <comment>Текст промпта хранится в хранилище значения (допускает большой объём).</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровайдерИИ</name>
    <comment>Пусто или «Локальный Ollama» — запрос на ваш сервер; «OpenRouter» — облако, нужен ключ в константе.</comment>
    <type>
      <types>EnumRef.ИАДО_ПровайдерыИИ</types>
    </type>
  </attributes>
</mdclass:Catalog>

DOCFSKDEVII.ИИАнализДокументовOllama/src/CommonModules/ИАДО_НастройкиАнализаИИВызовСервера/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает базовый URL Ollama из константы.
//
// Возвращаемое значение:
//  Строка - значение константы ИАДО_OllamaБазовыйURL.
//
Функция БазовыйURL_Ollama() Экспорт

	Возврат Константы.ИАДО_OllamaБазовыйURL.Получить();

КонецФункции

// Таймаут HTTP (сек). Ноль или отрицательное значение константы трактуется как 30.
//
// Возвращаемое значение:
//  Число - таймаут в секундах (не менее 1 по логике вызова HTTP после нормализации).
//
Функция ТаймаутHTTPСекунд() Экспорт

	ТаймаутИзКонстанты = Константы.ИАДО_OllamaТаймаутСек.Получить();
	Если ТаймаутИзКонстанты <= 0 Тогда
		Возврат 30;
	КонецЕсли;

	Возврат ТаймаутИзКонстанты;

КонецФункции

// Базовый URL API OpenRouter (v1). Если константа пуста — https://openrouter.ai/api/v1
//
Функция БазовыйURL_OpenRouter() Экспорт

	Значение = СокрЛП(Строка(Константы.ИАДО_OpenRouterБазовыйURL.Получить()));
	Если ПустаяСтрока(Значение) Тогда
		Возврат "https://openrouter.ai/api/v1";
	КонецЕсли;

	Возврат Значение;

КонецФункции

// Секретный ключ sk-or-… из личного кабинета OpenRouter.
//
Функция КлючAPI_OpenRouter() Экспорт

	Возврат СокрЛП(Строка(Константы.ИАДО_OpenRouterКлючAPI.Получить()));

КонецФункции

// Имя модели для теста и запасной вариант: константа или openrouter/free.
//
Функция МодельOpenRouterПоУмолчанию() Экспорт

	Значение = СокрЛП(Строка(Константы.ИАДО_OpenRouterМодельПоУмолчанию.Получить()));
	Если ПустаяСтрока(Значение) Тогда
		Возврат "openrouter/free";
	КонецЕсли;

	Возврат Значение;

КонецФункции

// Проверка Ollama с использованием констант расширения.
//
// Возвращаемое значение:
//  см. ИАДО_ИнтеграцияOllamaВызовСервера.ПроверитьДоступность
//
Функция ПроверитьПодключениеПоКонстантам() Экспорт

	Возврат ИАДО_ИнтеграцияOllamaВызовСервера.ПроверитьДоступность(БазовыйURL_Ollama(), ТаймаутHTTPСекунд());

КонецФункции

// Проверка генерации: промпт «Привет! как тебя зовут?» и модель из константы либо первого активного эксперта.
//
// Параметры:
//  ЗаписатьВЖурнал - Булево - при Истина записать результат в ИАДО_ЖурналОбращенийКИИ.
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево
//   * ТекстМодели - Строка - ответ модели при Успех = Истина
//   * ТекстДляПользователя - Строка - текст ошибки при Успех = Ложь
//
Функция ТестПодключенияСПромптомПоКонстантам(ЗаписатьВЖурнал = Ложь) Экспорт

	Ответ = Новый Структура("Успех, ТекстМодели, ТекстДляПользователя", Ложь, "", "");

	ИмяМодели = ИмяМоделиДляТестаПодключения();
	Если ПустаяСтрока(ИмяМодели) Тогда
		Ответ.ТекстДляПользователя =
			НСтр("ru = 'Не удалось определить модель: задайте константу «Ollama: модель по умолчанию» или создайте используемого эксперта ИИ с непустым именем модели.'");
		Если ЗаписатьВЖурнал Тогда
			ЗаписатьТестПодключенияВЖурнал(Ответ, "", 0, "");
		КонецЕсли;
		Возврат Ответ;
	КонецЕсли;

	ПромптТеста = "Привет! как тебя зовут?";
	РезультатВызова = ИАДО_ИнтеграцияOllamaВызовСервера.СгенерироватьОтвет(
		БазовыйURL_Ollama(), ТаймаутHTTPСекунд(), ИмяМодели, ПромптТеста);

	Если РезультатВызова.Успех Тогда
		Ответ.Успех = Истина;
		Ответ.ТекстМодели = РезультатВызова.ТекстМодели;
		Если ЗаписатьВЖурнал Тогда
			ЗаписатьТестПодключенияВЖурнал(Ответ, ИмяМодели, РезультатВызова.HTTPКод, РезультатВызова.ТекстМодели);
		КонецЕсли;
		Возврат Ответ;
	КонецЕсли;

	ТекстОшибки = РезультатВызова.СообщениеОбОшибке;
	Если ПустаяСтрока(ТекстОшибки) Тогда
		ТекстОшибки = РезультатВызова.ТекстОтвета;
	КонецЕсли;

	Ответ.ТекстДляПользователя = СтрШаблон(
		НСтр("ru = 'Ошибка вызова Ollama (модель «%1»): %2'"),
		ИмяМодели,
		ТекстОшибки);

	Если ЗаписатьВЖурнал Тогда
		ЗаписатьТестПодключенияВЖурнал(Ответ, ИмяМодели, РезультатВызова.HTTPКод, "");
	КонецЕсли;

	Возврат Ответ;

КонецФункции

// Тест облачного провайдера OpenRouter (chat/completions) по константам.
//
// Параметры:
//  ЗаписатьВЖурнал - Булево
//
// Возвращаемое значение:
//  Структура - см. ТестПодключенияСПромптомПоКонстантам
//
Функция ТестПодключенияOpenRouterПоКонстантам(ЗаписатьВЖурнал = Ложь) Экспорт

	Ответ = Новый Структура("Успех, ТекстМодели, ТекстДляПользователя", Ложь, "", "");

	Если ПустаяСтрока(КлючAPI_OpenRouter()) Тогда
		Ответ.ТекстДляПользователя =
			НСтр("ru = 'Заполните константу «OpenRouter: ключ API» (ключ sk-or-… с openrouter.ai).'");
		Если ЗаписатьВЖурнал Тогда
			ЗаписатьТестПодключенияВЖурнал(Ответ, "", 0, "");
		КонецЕсли;
		Возврат Ответ;
	КонецЕсли;

	ИмяМодели = ИмяМоделиДляТестаOpenRouter();
	Если ПустаяСтрока(ИмяМодели) Тогда
		Ответ.ТекстДляПользователя =
			НСтр("ru = 'Не удалось определить модель OpenRouter: задайте константу «OpenRouter: модель по умолчанию» или активного эксперта с провайдером OpenRouter и непустым именем модели.'");
		Если ЗаписатьВЖурнал Тогда
			ЗаписатьТестПодключенияВЖурнал(Ответ, "", 0, "");
		КонецЕсли;
		Возврат Ответ;
	КонецЕсли;

	ПромптТеста = "Привет! как тебя зовут?";
	РезультатВызова = ИАДО_ИнтеграцияOpenRouterВызовСервера.СгенерироватьОтвет(
		БазовыйURL_OpenRouter(),
		ТаймаутHTTPСекунд(),
		ИмяМодели,
		ПромптТеста,
		"",
		КлючAPI_OpenRouter());

	Если РезультатВызова.Успех Тогда
		Ответ.Успех = Истина;
		Ответ.ТекстМодели = РезультатВызова.ТекстМодели;
		Если ЗаписатьВЖурнал Тогда
			ЗаписатьТестПодключенияВЖурнал(Ответ, ИмяМодели, РезультатВызова.HTTPКод, РезультатВызова.ТекстМодели);
		КонецЕсли;
		Возврат Ответ;
	КонецЕсли;

	ТекстОшибки = РезультатВызова.СообщениеОбОшибке;
	Если ПустаяСтрока(ТекстОшибки) Тогда
		ТекстОшибки = РезультатВызова.ТекстОтвета;
	КонецЕсли;

	Ответ.ТекстДляПользователя = СтрШаблон(
		НСтр("ru = 'Ошибка вызова OpenRouter (модель «%1»): %2'"),
		ИмяМодели,
		ТекстОшибки);

	Если ЗаписатьВЖурнал Тогда
		ЗаписатьТестПодключенияВЖурнал(Ответ, ИмяМодели, РезультатВызова.HTTPКод, "");
	КонецЕсли;

	Возврат Ответ;

КонецФункции

// Загружает список моделей с Ollama (константа базового URL) и обновляет регистр ИАДО_МоделиЛокальногоOllama.
// Новые имена получают ДоступнаДляВыбора = Ложь. Снятые с сервера помечаются ЕстьНаСервере = Ложь, флаги выбора сохраняются.
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево
//   * КоличествоНаСервере - Число
//   * КоличествоВРегистре - Число
//   * ТекстДляПользователя - Строка
//
Функция ОбновитьКэшМоделейOllamaПоКонстантам() Экспорт

	Ответ = Новый Структура("Успех, КоличествоНаСервере, КоличествоВРегистре, ТекстДляПользователя",
		Ложь, 0, 0, "");

	ДанныеМоделей = ИАДО_ИнтеграцияOllamaВызовСервера.СписокМоделейССервера(БазовыйURL_Ollama(), ТаймаутHTTPСекунд());
	Если Не ДанныеМоделей.Успех Тогда
		ТекстОшибки = ДанныеМоделей.СообщениеОбОшибке;
		Если ПустаяСтрока(ТекстОшибки) Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Код HTTP %1'"), Формат(ДанныеМоделей.HTTPКод, "ЧГ="));
		КонецЕсли;
		Ответ.ТекстДляПользователя = ТекстОшибки;
		Возврат Ответ;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	М.ИмяМодели КАК ИмяМодели,
	|	М.ДоступнаДляВыбора КАК ДоступнаДляВыбора,
	|	М.РазмерБайт КАК РазмерБайт
	|ИЗ
	|	РегистрСведений.ИАДО_МоделиЛокальногоOllama КАК М";

	Прежние = Новый Соответствие;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = Новый Структура("ДоступнаДляВыбора, РазмерБайт", Выборка.ДоступнаДляВыбора, Выборка.РазмерБайт);
		Прежние.Вставить(Выборка.ИмяМодели, Стр);
	КонецЦикла;

	ИменаССервера = Новый Соответствие;
	Для Каждого М Из ДанныеМоделей.Модели Цикл
		ИменаССервера.Вставить(М.Имя, Истина);
	КонецЦикла;

	Набор = РегистрыСведений.ИАДО_МоделиЛокальногоOllama.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Набор.Очистить();

	Для Каждого М Из ДанныеМоделей.Модели Цикл

		Зап = Набор.Добавить();
		Зап.ИмяМодели = М.Имя;
		Преж = Прежние.Получить(М.Имя);
		Если Преж = Неопределено Тогда
			Зап.ДоступнаДляВыбора = Ложь;
		Иначе
			Зап.ДоступнаДляВыбора = Преж.ДоступнаДляВыбора;
		КонецЕсли;
		Зап.ЕстьНаСервере = Истина;
		Зап.РазмерБайт = М.РазмерБайт;

	КонецЦикла;

	Для Каждого КлючИЗначение Из Прежние Цикл

		Если ИменаССервера.Получить(КлючИЗначение.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Зап = Набор.Добавить();
		Зап.ИмяМодели = КлючИЗначение.Ключ;
		Зап.ДоступнаДляВыбора = КлючИЗначение.Значение.ДоступнаДляВыбора;
		Зап.ЕстьНаСервере = Ложь;
		Зап.РазмерБайт = КлючИЗначение.Значение.РазмерБайт;

	КонецЦикла;

	Набор.Записать();

	Ответ.Успех = Истина;
	Ответ.КоличествоНаСервере = ДанныеМоделей.Модели.Количество();
	Ответ.КоличествоВРегистре = Набор.Количество();
	Ответ.ТекстДляПользователя = СтрШаблон(
		НСтр("ru = 'Синхронизация выполнена. Моделей на сервере: %1, всего записей в регистре: %2. Отметьте «Доступна для выбора в эксперте» для нужных имён и откройте карточку эксперта.'"),
		Формат(Ответ.КоличествоНаСервере, "ЧГ="),
		Формат(Ответ.КоличествоВРегистре, "ЧГ="));

	Возврат Ответ;

КонецФункции

// Имена моделей Ollama, разрешённые для выбора в карточке эксперта (регистр + синхронизация с сервером).
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция СписокИменМоделейOllamaДляВыбораВЭксперте() Экспорт

	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Модели.ИмяМодели КАК Имя
	|ИЗ
	|	РегистрСведений.ИАДО_МоделиЛокальногоOllama КАК Модели
	|ГДЕ
	|	Модели.ДоступнаДляВыбора
	|	И Модели.ЕстьНаСервере
	|
	|УПОРЯДОЧИТЬ ПО
	|	Имя";

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Имя);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Для всех записей регистра с ЕстьНаСервере = Истина выставляет ДоступнаДляВыбора = Истина.
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево
//   * КоличествоИзменено - Число - сколько записей получили «Доступна» впервые (была Ложь)
//   * ВсегоНаСервере - Число - записей с ЕстьНаСервере после операции
//   * ТекстДляПользователя - Строка
//
Функция ВключитьВсеМоделиOllamaССервераДляВыбораВЭксперте() Экспорт

	Ответ = Новый Структура("Успех, КоличествоИзменено, ВсегоНаСервере, ТекстДляПользователя",
		Истина, 0, 0, "");

	Набор = РегистрыСведений.ИАДО_МоделиЛокальногоOllama.СоздатьНаборЗаписей();
	Набор.Прочитать();

	Изменено = 0;
	ВсегоНаСервере = 0;

	Для Каждого ЗаписьНабора Из Набор Цикл

		Если Не ЗаписьНабора.ЕстьНаСервере Тогда
			Продолжить;
		КонецЕсли;

		ВсегоНаСервере = ВсегоНаСервере + 1;

		Если Не ЗаписьНабора.ДоступнаДляВыбора Тогда
			Изменено = Изменено + 1;
		КонецЕсли;

		ЗаписьНабора.ДоступнаДляВыбора = Истина;

	КонецЦикла;

	Набор.Записать();

	Ответ.КоличествоИзменено = Изменено;
	Ответ.ВсегоНаСервере = ВсегоНаСервере;

	Если ВсегоНаСервере = 0 Тогда
		Ответ.ТекстДляПользователя =
			НСтр("ru = 'Нет записей с признаком «Есть на сервере». Сначала выполните «Загрузить модели Ollama с сервера».'");
	Иначе
		Ответ.ТекстДляПользователя = СтрШаблон(
			НСтр("ru = 'Отмечено для выбора в эксперте: %1 моделей на сервере; впервые включено флагов: %2.'"),
			Формат(ВсегоНаСервере, "ЧГ="),
			Формат(Изменено, "ЧГ="));
	КонецЕсли;

	Возврат Ответ;

КонецФункции

// Подбирает эксперта по виду и тематике документа по первому подходящему правилу
// (минимальный ПорядокПрименения среди совпадающих строк).
//
// Параметры:
//  ВидДокумента - СправочникСсылка.ВидыДокументов
//  ТематикаДокумента - СправочникСсылка.ТематикиДокументов
//
// Возвращаемое значение:
//  СправочникСсылка.ИАДО_ЭкспертыИИ - пустая ссылка, если нет подходящего активного эксперта.
//
Функция ПодобратьЭксперта(Знач ВидДокумента, Знач ТематикаДокумента) Экспорт

	ДанныеПравила = ДанныеПодходящегоПравила(ВидДокумента, ТематикаДокумента);
	Возврат ДанныеПравила.Эксперт;

КонецФункции

// Параметры вызова модели по виду и тематике: эксперт, модель, системный промпт эксперта и промпт из строки правила.
//
// Параметры:
//  ВидДокумента - СправочникСсылка.ВидыДокументов
//  ТематикаДокумента - СправочникСсылка.ТематикиДокументов
//
// Возвращаемое значение:
//  Структура:
//   * Эксперт - СправочникСсылка.ИАДО_ЭкспертыИИ
//   * ИмяМодели - Строка
//   * СистемныйПромпт - Строка - из карточки эксперта
//   * ПромптОбработкиДокумента - Строка - из ресурса правила (как обработать документ)
//   * ПровайдерИИ - ПеречислениеСсылка.ИАДО_ПровайдерыИИ
//
Функция ПараметрыАнализаДокументаПоПравилам(Знач ВидДокумента, Знач ТематикаДокумента) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Эксперт", Справочники.ИАДО_ЭкспертыИИ.ПустаяСсылка());
	Результат.Вставить("ИмяМодели", "");
	Результат.Вставить("СистемныйПромпт", "");
	Результат.Вставить("ПромптОбработкиДокумента", "");
	Результат.Вставить("ПровайдерИИ", Перечисления.ИАДО_ПровайдерыИИ.ЛокальныйOllama);

	ДанныеПравила = ДанныеПодходящегоПравила(ВидДокумента, ТематикаДокумента);
	Если Не ЗначениеЗаполнено(ДанныеПравила.Эксперт) Тогда
		Возврат Результат;
	КонецЕсли;

	ПараметрыЭксп = ПараметрыЭксперта(ДанныеПравила.Эксперт);
	Результат.Эксперт = ДанныеПравила.Эксперт;
	Результат.ИмяМодели = ПараметрыЭксп.ИмяМодели;
	Результат.СистемныйПромпт = ПараметрыЭксп.ТекстПромпта;
	Результат.ПровайдерИИ = ПараметрыЭксп.ПровайдерИИ;
	Результат.ПромптОбработкиДокумента = ТекстИзХранилищаЗначения(ДанныеПравила.ПромптОбработкиХранилище);

	Возврат Результат;

КонецФункции

// Возвращает имя модели и текст системного промпта для выбранного эксперта.
//
// Параметры:
//  Эксперт - СправочникСсылка.ИАДО_ЭкспертыИИ
//
// Возвращаемое значение:
//  Структура:
//   * ИмяМодели - Строка
//   * ТекстПромпта - Строка
//   * ПровайдерИИ - ПеречислениеСсылка.ИАДО_ПровайдерыИИ
//
Функция ПараметрыЭксперта(Знач Эксперт) Экспорт

	Результат = Новый Структура("ИмяМодели, ТекстПромпта, ПровайдерИИ", "", "",
		Перечисления.ИАДО_ПровайдерыИИ.ЛокальныйOllama);

	Если Не ЗначениеЗаполнено(Эксперт) Тогда
		Возврат Результат;
	КонецЕсли;

	Значения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Эксперт,
		"ИмяМоделиOllama, СистемныйПромптХранилище, ПровайдерИИ");
	Результат.ИмяМодели = Строка(Значения.ИмяМоделиOllama);

	ХранилищеПромпта = Значения.СистемныйПромптХранилище;
	Результат.ТекстПромпта = ТекстИзХранилищаЗначения(ХранилищеПромпта);

	Если ЗначениеЗаполнено(Значения.ПровайдерИИ) Тогда
		Результат.ПровайдерИИ = Значения.ПровайдерИИ;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Проверяет готовность анализа ИИ: есть подходящая строка регистра с активным экспертом, непустым промптом и моделью.
// Пустая тематика в измерении правила трактуется как «любая тематика».
//
// Параметры:
//  ВидДокумента - СправочникСсылка.ВидыДокументов
//  ТематикаДокумента - СправочникСсылка.ТематикиДокументов
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьПравилоДляПередачиВИИПоВидуИТематике(Знач ВидДокумента, Знач ТематикаДокумента) Экспорт

	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		Возврат Ложь;
	КонецЕсли;

	ДанныеПравила = ДанныеПодходящегоПравила(ВидДокумента, ТематикаДокумента);
	Если Не ЗначениеЗаполнено(ДанныеПравила.Эксперт) Тогда
		Возврат Ложь;
	КонецЕсли;

	ТекстПромптаПравила = ТекстИзХранилищаЗначения(ДанныеПравила.ПромптОбработкиХранилище);
	Если ПустаяСтрока(СокрЛП(ТекстПромптаПравила)) Тогда
		Возврат Ложь;
	КонецЕсли;

	ПараметрыЭксп = ПараметрыЭксперта(ДанныеПравила.Эксперт);
	Возврат Не ПустаяСтрока(СокрЛП(ПараметрыЭксп.ИмяМодели));

КонецФункции

// Доступность передачи файла в ИИ по ссылке на документ: заполнен вид и есть подходящее правило (вид + тематика).
//
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//
// Возвращаемое значение:
//  Булево
//
Функция ДоступнаПередачаФайлаВИИПоДокументу(Знач ДокументСсылка) Экспорт

	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;

	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ВидДокумента, Тематика");
	Возврат ЕстьПравилоДляПередачиВИИПоВидуИТематике(РеквизитыДокумента.ВидДокумента, РеквизитыДокумента.Тематика);

КонецФункции

// Файлы, прикреплённые к документу предприятия (владелец файла), для выбора при анализе ИИ.
//
// Параметры:
//  ДокументСсылка - СправочникСсылка.ДокументыПредприятия
//
// Возвращаемое значение:
//  Массив из Структура:
//   * Файл - СправочникСсылка.Файлы
//   * Представление - Строка
//
Функция СписокФайловДокументаДляАнализаИИ(Знач ДокументСсылка) Экспорт

	Результат = Новый Массив;

	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Файл,
	|	Файлы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &Владелец
	|	И НЕ Файлы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	Запрос.УстановитьПараметр("Владелец", ДокументСсылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		СтрокаСписка = Новый Структура;
		СтрокаСписка.Вставить("Файл", Выборка.Файл);
		СтрокаСписка.Вставить("Представление", СокрЛП(Строка(Выборка.Наименование)));
		Результат.Добавить(СтрокаСписка);

	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьТестПодключенияВЖурнал(Ответ, ИмяМодели, HTTPКод = 0, ТекстОтветаКратко = "")

	ПарамЖурнал = Новый Структура;
	ПарамЖурнал.Вставить("ВидОперации", "ТестПодключения");
	ПарамЖурнал.Вставить("Успешно", Ответ.Успех);
	ПарамЖурнал.Вставить("HTTPКод", HTTPКод);

	Если Ответ.Успех Тогда
		ПарамЖурнал.Вставить("Сообщение", НСтр("ru = 'Тест подключения выполнен успешно'"));
		ПарамЖурнал.Вставить("ТекстОтветаКратко", Лев(Строка(ТекстОтветаКратко), 500));
	Иначе
		ПарамЖурнал.Вставить("Сообщение", Ответ.ТекстДляПользователя);
	КонецЕсли;

	ПарамЖурнал.Вставить("ИмяМодели", Строка(ИмяМодели));
	ИАДО_ЖурналИИВызовСервера.ДобавитьЗапись(ПарамЖурнал);

КонецПроцедуры

Функция ДанныеПодходящегоПравила(Знач ВидДокумента, Знач ТематикаДокумента)

	Пустой = Новый Структура;
	Пустой.Вставить("Эксперт", Справочники.ИАДО_ЭкспертыИИ.ПустаяСсылка());
	Пустой.Вставить("ПромптОбработкиХранилище", Неопределено);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Правила.Эксперт КАК Эксперт,
	|	Правила.ПромптОбработкиДокументаХранилище КАК ПромптОбработкиДокументаХранилище
	|ИЗ
	|	РегистрСведений.ИАДО_ПравилаЭкспертовДокументов КАК Правила
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИАДО_ЭкспертыИИ КАК Эксперты
	|		ПО Правила.Эксперт = Эксперты.Ссылка
	|ГДЕ
	|	Эксперты.Используется
	|	И НЕ Эксперты.ПометкаУдаления
	|	И (Правила.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументов.ПустаяСсылка)
	|		ИЛИ Правила.ВидДокумента = &ВидДокумента)
	|	И (Правила.ТематикаДокумента = ЗНАЧЕНИЕ(Справочник.ТематикиДокументов.ПустаяСсылка)
	|		ИЛИ Правила.ТематикаДокумента = &ТематикаДокумента)
	|УПОРЯДОЧИТЬ ПО
	|	Правила.ПорядокПрименения";

	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.УстановитьПараметр("ТематикаДокумента", ТематикаДокумента);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Пустой;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Данные = Новый Структура;
	Данные.Вставить("Эксперт", Выборка.Эксперт);
	Данные.Вставить("ПромптОбработкиХранилище", Выборка.ПромптОбработкиДокументаХранилище);

	Возврат Данные;

КонецФункции

Функция ТекстИзХранилищаЗначения(Знач ХранилищеЗначения)

	Если ХранилищеЗначения = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Попытка
		Возврат Строка(ХранилищеЗначения.Получить());
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции

Функция ИмяМоделиДляТестаПодключения()

	ИзКонстанты = СокрЛП(Строка(Константы.ИАДО_OllamaМодельПоУмолчанию.Получить()));
	Если Не ПустаяСтрока(ИзКонстанты) Тогда
		Возврат ИзКонстанты;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Эксперты.ИмяМоделиOllama КАК ИмяМоделиOllama
	|ИЗ
	|	Справочник.ИАДО_ЭкспертыИИ КАК Эксперты
	|ГДЕ
	|	Эксперты.Используется
	|	И НЕ Эксперты.ПометкаУдаления
	|	И Эксперты.ИмяМоделиOllama <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Эксперты.Код";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат СокрЛП(Строка(Выборка.ИмяМоделиOllama));

КонецФункции

Функция ИмяМоделиДляТестаOpenRouter()

	ИзКонстанты = СокрЛП(Строка(Константы.ИАДО_OpenRouterМодельПоУмолчанию.Получить()));
	Если Не ПустаяСтрока(ИзКонстанты) Тогда
		Возврат ИзКонстанты;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Эксперты.ИмяМоделиOllama КАК ИмяМоделиOllama
	|ИЗ
	|	Справочник.ИАДО_ЭкспертыИИ КАК Эксперты
	|ГДЕ
	|	Эксперты.Используется
	|	И НЕ Эксперты.ПометкаУдаления
	|	И Эксперты.ИмяМоделиOllama <> """"
	|	И Эксперты.ПровайдерИИ = ЗНАЧЕНИЕ(Перечисление.ИАДО_ПровайдерыИИ.OpenRouterChat)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Эксперты.Код";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "openrouter/free";
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат СокрЛП(Строка(Выборка.ИмяМоделиOllama));

КонецФункции

#КонецОбласти

#КонецЕсли
